rheoConvective3D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

// Laminar viscosity
nu              [0 2 -1 0 0 0 0] 1.e-6;

// Thermal expansion coefficient
beta            [0 0 0 -1 0 0 0] 2.e-5;

// Reference temperature
TRef            [0 0 0 1 0 0 0] 3000;

// Laminar Prandtl number
Pr              [0 0 0 0 0 0 0] 1.;

// Turbulent Prandtl number
Prt             [0 0 0 0 0 0 0] 1000;

/////////////ADDED/////////////////////
nu0         [0 2 -1 0 0 0 0]   1.25e-15;

E           [1 2 -2 0 0 0 0]  3e5;

Rgas        [1 2 -2 -1 0 0 0]  8.314 ;

Vol         [0 3 0 0 0 0 0]  6e-6;

rho0        [1 -3 0 0 0 0 0]  4e3;

z0          [0 1 0 0 0 0 0]  3e6; // quota dove p_atmo = 0




// ************************************************************************* //
